# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

brew "bat"
brew "bottom"
brew "curl"
brew "direnv"
brew "doppler"
brew "fd"
brew "gawk"
brew "gh"
brew "git"
brew "glab"
brew "goenv"
brew "helm"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "lazygit"
brew "neovim"
brew "nnn"
brew "nvm"
brew "podman"
brew "pyenv"
brew "ripgrep"
brew "rustup"
brew "starship"
brew "tenv"
brew "tree-sitter"
brew "tldr"
brew "tmux"
brew "tpm"
brew "wget"
brew "yadm"
brew "yq"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zoxide"

cask "1password"
cask "1password-cli"
cask "arc"
cask "discord"
cask "fliqlo"
cask "font-awesome-terminal-fonts"
cask "font-geist-mono"
cask "ghostty"
cask "grammarly-desktop"
cask "httpie"
cask "logi-options+"
# cask "microsoft-teams"
cask "obsidian"
cask "podman-desktop"
cask "raycast"
cask "session-manager-plugin"
cask "slack"
cask "spotify"
cask "telegram"
cask "vlc"
cask "wezterm"
cask "zoom"
