# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

brew "awscli"
brew "bat"
brew "bottom"
brew "curl"
brew "direnv"
brew "dive"
brew "doppler"
brew "fd"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-delta"
brew "glab"
brew "gnu-sed"
brew "goenv", postinstall: "goenv install 1.24.2 && goenv global 1.24.2"
brew "helm"
brew "jq"
brew "just"
brew "k9s"
brew "kubernetes-cli"
brew "lazygit"
brew "neovim"
brew "nnn"
brew "nvm"
brew "podman"
brew "pyenv"
brew "qemu"
brew "ripgrep"
brew "rustup", postinstall: "rustup default stable"
brew "starship"
brew "tenv"
brew "tldr"
brew "tmux"
brew "tpm"
brew "tree-sitter"
brew "wget"
brew "yadm"
brew "yq"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# cask "1password"
cask "1password-cli"
cask "arc"
cask "discord"
cask "fliqlo"
cask "font-awesome-terminal-fonts", require_sha: false
cask "font-geist-mono"
cask "ghostty"
cask "grammarly-desktop"
cask "httpie"
cask "logi-options+", require_sha: false
cask "microsoft-edge"
cask "microsoft-teams"
cask "obsidian"
cask "podman-desktop"
cask "raycast"
cask "session-manager-plugin"
cask "slack"
cask "spotify", require_sha: false
cask "telegram"
cask "utm"
cask "virtualbox"
cask "vlc"
cask "wezterm"
cask "zen"
cask "zoom"
